src/cf/Catalogs/вогРейтинги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогРейтинги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обои</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плитка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогРейтинги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) И Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Отказ = Истина;
		Сообщить("Дата окончания должна быть болльше даты начала");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоРоли(Команда)
	
	Если НЕ Объект.Обои И НЕ Объект.Плитка Тогда
		Сообщить("Выберите хотя бы одно направление деятельности");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьПоРолиЗавершение", ЭтотОбъект), );
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоРолиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокУчастниковПоРоли(Результат);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУчастниковПоРоли(ВыбраннаяРоль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиЗадач.Исполнитель КАК Участник,
		|	ИсполнителиЗадач.РольИсполнителя КАК Роль,
		|	ИсполнителиЗадач.Исполнитель.CRM_НаправлениеДеятельности КАК НаправлениеДеятельности
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	НЕ ИсполнителиЗадач.Исполнитель.Недействителен
		|	И НЕ ИсполнителиЗадач.Исполнитель.ПометкаУдаления
		|	И ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
		|	И ИсполнителиЗадач.Исполнитель.CRM_НаправлениеДеятельности В(&НаправлениеДеятельности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсполнителиЗадач.Исполнитель,
		|	ИсполнителиЗадач.РольИсполнителя,
		|	ИсполнителиЗадач.Исполнитель.CRM_НаправлениеДеятельности";
	
	Запрос.УстановитьПараметр("РольИсполнителя", ВыбраннаяРоль);
	СписокНаправленийДеятельности = Новый Массив;
	СписокНаправленийДеятельности.Добавить(Справочники.НаправленияДеятельности.ПустаяСсылка());
	Если Объект.Обои Тогда
		СписокНаправленийДеятельности.Добавить(Справочники.НаправленияДеятельности.Обои);
	КонецЕсли;
	Если Объект.Плитка Тогда
		СписокНаправленийДеятельности.Добавить(Справочники.НаправленияДеятельности.Плитка);
	КонецЕсли;
	Запрос.УстановитьПараметр("НаправлениеДеятельности",СписокНаправленийДеятельности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.Участники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиУчастникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Участник) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.НаправлениеДеятельности = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Участник,"CRM_НаправлениеДеятельности");
	
КонецПроцедуры
